WindTunnelGUI/runs/Run_2_20260122_231630/windTunnelCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       92401;
    }
    walls
    {
        type            wall;
        nFaces          2832;
        startFace       92551;
    }
    inlet
    {
        type            patch;
        nFaces          158;
        startFace       95383;
    }
    model
    {
        type            wall;
        nFaces          1758;
        startFace       95541;
    }
)

// ************************************************************************* //
